softwarecrash/Solar2MQTT-ESP8266/src/main.cpp

/*
Solar2MQTT Project
https://github.com/softwarecrash/Solar2MQTT
*/
#include "main.h"
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <ESP8266mDNS.h>
#include <ESPAsyncWiFiManager.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include "Settings.h"
#include "html.h"
#include "favicon.h"
#include "PI_Serial/PI_Serial.h"

#ifdef TEMPSENS_PIN
#include <OneWire.h>
#include <DallasTemperature.h>
#include <NonBlockingDallas.h>
#endif




PI_Serial mppClient(INVERTER_RX, INVERTER_TX);
WiFiClient client;
PubSubClient mqttclient(client);
AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
AsyncWebSocketClient *wsClient;
DNSServer dns;
Settings settings;
WebSerial webSerial;

#ifdef TEMPSENS_PIN
OneWire oneWire(TEMPSENS_PIN);
DallasTemperature dallasTemp(&oneWire);
NonBlockingDallas tempSens(&dallasTemp);
DeviceAddress tempDeviceAddress;
uint8_t numOfTempSens;
#endif

#include "status-LED.h"

// new importetd
static constexpr size_t MQTT_CLIENT_ID_LEN = DEVICE_NAME_LEN + 8;
static constexpr size_t MQTT_TOPIC_BUFFER_LEN = MQTT_TOPIC_LEN + 128;
char mqttClientId[MQTT_CLIENT_ID_LEN];
ADC_MODE(ADC_VCC);

// flag for saving data
unsigned long mqtttimer = 0;
unsigned long RestartTimer = 0;
unsigned long slowDownTimer = 0;
bool shouldSaveConfig = false;
char mqtt_server[MQTT_SERVER_LEN];
bool restartNow = false;
bool askInverterOnce = false;
bool workerCanRun = true;
bool publishFirst = false;
bool haDiscTrigger = false;
unsigned int jsonSize = 0;
uint32_t bootcount = 0;
String commandFromUser;
String customResponse;
bool loopbackRequested = false;
bool loopbackInProgress = false;
bool loopbackDone = false;
bool loopbackOk = false;
bool loopbackPrevWorker = true;
unsigned long loopbackWaitStart = 0;
String loopbackMessage;
unsigned long wsCleanupTimer = 0;
const uint32_t WS_MIN_HEAP = 4000;
const uint32_t HA_MIN_HEAP = 12000;
const uint32_t HA_MIN_INTERVAL_MS = 60000;
unsigned long haDiscLastAttempt = 0;
struct DebugDownloadState
{
  uint8_t phase = 0;
  uint8_t headerStep = 0;
  uint8_t rawIndex = 0;
  uint8_t sectionIndex = 0;
  bool sectionInit = false;
  bool sectionHeaderPrinted = false;
  JsonObject sectionObj;
  JsonObject::iterator sectionIt;
  String line;
  size_t lineOffset = 0;
};

bool firstPublish;
static constexpr size_t MAIN_JSON_DOC_SIZE = 8192;
StaticJsonDocument<MAIN_JSON_DOC_SIZE> Json;                 // main Json (static to reduce heap churn)
JsonObject deviceJson = Json["EspData"].to<JsonObject>();    // basic device data
JsonObject staticData = Json["DeviceData"].to<JsonObject>(); // battery package data
JsonObject liveData = Json["LiveData"].to<JsonObject>();     // battery package data


//----------------------------------------------------------------------
void saveConfigCallback()
{
  writeLog("Should save config");
  shouldSaveConfig = true;
}

void notifyClients()
{
  if (ws.count() == 0)
  {
    return;
  }

  char payload[512];
  size_t pos = 0;
  bool first = true;

  auto appendComma = [&]() {
    if (!first && pos < sizeof(payload)) {
      payload[pos++] = ',';
    }
    first = false;
  };

  auto appendKey = [&](const char *key) {
    appendComma();
    int written = snprintf(payload + pos, sizeof(payload) - pos, "\"%s\":", key);
    if (written <= 0) {
      return;
    }
    size_t w = static_cast<size_t>(written);
    if (w >= sizeof(payload) - pos) {
      pos = sizeof(payload);
    } else {
      pos += w;
    }
  };

  auto appendVariant = [&](const char *key, JsonVariantConst value) {
    if (pos >= sizeof(payload)) return;
    appendKey(key);
    if (pos >= sizeof(payload)) return;
    pos += serializeJson(value, payload + pos, sizeof(payload) - pos);
  };

  payload[pos++] = '{';
  auto appendStringValue = [&](const char *value) {
    if (pos >= sizeof(payload)) return;
    payload[pos++] = '"';
    if (value != nullptr) {
      for (const char *p = value; *p != '\0' && pos + 2 < sizeof(payload); ++p) {
        char c = *p;
      switch (c) {
      case '\\':
      case '"':
        if (pos + 2 >= sizeof(payload)) { pos = sizeof(payload); break; }
        payload[pos++] = '\\';
        payload[pos++] = c;
        break;
      case '\n':
        if (pos + 2 >= sizeof(payload)) { pos = sizeof(payload); break; }
        payload[pos++] = '\\';
        payload[pos++] = 'n';
        break;
      case '\r':
        if (pos + 2 >= sizeof(payload)) { pos = sizeof(payload); break; }
        payload[pos++] = '\\';
        payload[pos++] = 'r';
        break;
      case '\t':
        if (pos + 2 >= sizeof(payload)) { pos = sizeof(payload); break; }
        payload[pos++] = '\\';
        payload[pos++] = 't';
        break;
      default:
        payload[pos++] = c;
        break;
      }
      if (pos >= sizeof(payload)) break;
    }
    }
    if (pos < sizeof(payload)) {
      payload[pos++] = '"';
    }
  };

  auto appendVariantByKey = [&](const char *key) {
    if (pos >= sizeof(payload)) return;
    JsonVariantConst value = liveData[key];
    if (value.is<JsonVariantConst>()) {
      appendKey(key);
      if (pos >= sizeof(payload)) return;
      if (value.is<const char *>() || value.is<String>()) {
        const char *str = value.as<const char *>();
        if (!str) {
          str = "";
        }
        appendStringValue(str);
      } else {
        pos += serializeJson(value, payload + pos, sizeof(payload) - pos);
      }
    }
  };

  appendVariantByKey("PV_Input_Voltage");
  appendVariantByKey("PV_Input_Current");
  appendVariantByKey("PV_Charging_Power");
  appendVariantByKey("PV2_Input_Voltage");
  appendVariantByKey("PV2_Input_Current");
  appendVariantByKey("PV2_Charging_Power");
  appendVariantByKey("AC_In_Voltage");
  appendVariantByKey("AC_In_Frequenz");
  appendVariantByKey("AC_Out_Voltage");
  appendVariantByKey("AC_Out_Frequenz");
  appendVariantByKey("AC_Out_Watt");
  appendVariantByKey("AC_Out_Percent");
  appendVariantByKey("Inverter_Bus_Temperature");
  appendVariantByKey("Battery_Voltage");
  appendVariantByKey("Battery_Percent");
  appendVariantByKey("Battery_Load");
  appendVariantByKey("Inverter_Operation_Mode");

