softwarecrash/Solar2MQTT-ESP8266/src/main.cpp
  appendKey("Wifi_RSSI");
  if (pos < sizeof(payload)) {
    int written = snprintf(payload + pos, sizeof(payload) - pos, "%d", WiFi.RSSI());
    if (written > 0) {
      size_t w = static_cast<size_t>(written);
      if (w >= sizeof(payload) - pos) {
        pos = sizeof(payload);
      } else {
        pos += w;
      }
    }
  }

  if (pos < sizeof(payload)) {
    payload[pos++] = '}';
  } else {
    payload[sizeof(payload) - 1] = '}';
    pos = sizeof(payload);
  }

  ws.textAll(payload, pos);
}

void finishLoopback(bool ok, const String &message)
{
  loopbackOk = ok;
  loopbackMessage = message;
  loopbackDone = true;
  loopbackInProgress = false;
  mppClient.setSuspend(false);
  workerCanRun = loopbackPrevWorker;
}

void handleLoopback()
{
  if (loopbackRequested && !loopbackInProgress)
  {
    loopbackRequested = false;
    loopbackInProgress = true;
    loopbackDone = false;
    loopbackOk = false;
    loopbackMessage = "Running...";
    loopbackPrevWorker = workerCanRun;
    workerCanRun = false;
    mppClient.setSuspend(true);
    loopbackWaitStart = millis();
    return;
  }

  if (!loopbackInProgress)
  {
    return;
  }

  if (mppClient.isBusy())
  {
    if (millis() - loopbackWaitStart > 5000)
    {
      finishLoopback(false, "Serial busy (autodetect running)");
    }
    return;
  }

  String details;
  bool ok = mppClient.loopbackTest(details);
  finishLoopback(ok, details);
}

static const char *getDebugSectionName(uint8_t index)
{
  switch (index)
  {
  case 0:
    return "EspData";
  case 1:
    return "DeviceData";
  case 2:
    return "LiveData";
  default:
    return "";
  }
}

static void buildRawLine(uint8_t index, String &line)
{
  line = "";
  switch (index)
  {
  case 0:
    line = F("Q1: ");
    line += mppClient.get.raw.q1;
    break;
  case 1:
    line = F("QPIGS: ");
    line += mppClient.get.raw.qpigs;
    break;
  case 2:
    line = F("QPIGS2: ");
    line += mppClient.get.raw.qpigs2;
    break;
  case 3:
    line = F("QPIRI: ");
    line += mppClient.get.raw.qpiri;
    break;
  case 4:
    line = F("QT: ");
    line += mppClient.get.raw.qt;
    break;
  case 5:
    line = F("QET: ");
    line += mppClient.get.raw.qet;
    break;
  case 6:
    line = F("QEY: ");
    line += mppClient.get.raw.qey;
    break;
  case 7:
    line = F("QEM: ");
    line += mppClient.get.raw.qem;
    break;
  case 8:
    line = F("QED: ");
    line += mppClient.get.raw.qed;
    break;
  case 9:
    line = F("QLT: ");
    line += mppClient.get.raw.qlt;
    break;
  case 10:
    line = F("QLY: ");
    line += mppClient.get.raw.qly;
    break;
  case 11:
    line = F("QLM: ");
    line += mppClient.get.raw.qlm;
    break;
  case 12:
    line = F("QLD: ");
    line += mppClient.get.raw.qld;
    break;
  case 13:
    line = F("QPI: ");
    line += mppClient.get.raw.qpi;
    break;
  case 14:
    line = F("QMOD: ");
    line += mppClient.get.raw.qmod;
    break;
  case 15:
    line = F("QALL: ");
    line += mppClient.get.raw.qall;
    break;
  case 16:
    line = F("QMN: ");
    line += mppClient.get.raw.qmn;
    break;
  case 17:
    line = F("QPIWS: ");
    line += mppClient.get.raw.qpiws;
    break;
  case 18:
    line = F("QFLAG: ");
    line += mppClient.get.raw.qflag;
    break;
  case 19:
    line = F("CommandAnswer: ");
    line += mppClient.get.raw.commandAnswer;
    break;
  default:
    break;
  }
  if (line.length() > 0)
  {
    line += "\n";
  }
}

static bool buildNextDebugLine(DebugDownloadState &state)
{
  state.line = "";
  state.lineOffset = 0;

  if (state.phase == 0)
  {
    switch (state.headerStep)
    {
    case 0:
      state.line = "Solar2MQTT Debug Data\n";
      state.headerStep++;
      return true;
    case 1:
      state.line = "Device: ";
      state.line += settings.data.deviceName;
      state.line += "\n";
      state.headerStep++;
      return true;
    case 2:
      state.line = "Uptime: ";
      {
        char uptimeBuf[16];
        snprintf(uptimeBuf, sizeof(uptimeBuf), "%lu", millis() / 1000);
        state.line += uptimeBuf;
      }
      state.line += " s\n";
      state.headerStep++;
      return true;
    case 3:
      state.line = "\n";
      state.headerStep++;
      return true;
    case 4:
      state.line = "[RAW]\n";
      state.headerStep++;
      state.phase = 1;
      return true;
    default:
      state.phase = 1;
      break;
    }
  }

  if (state.phase == 1)
  {
    if (state.rawIndex < 20)
    {
      buildRawLine(state.rawIndex, state.line);
      state.rawIndex++;
      return true;
    }
    state.phase = 2;
    state.sectionIndex = 0;
    state.sectionInit = false;
    state.sectionHeaderPrinted = false;
    state.line = "\n[PARSED]\n";
    return true;
  }

  while (state.phase == 2)
  {
    if (state.sectionIndex >= 3)
    {
      state.phase = 3;
      break;
    }

    const char *sectionName = getDebugSectionName(state.sectionIndex);
    if (!state.sectionInit)
    {
      state.sectionObj = Json[sectionName].as<JsonObject>();
      state.sectionIt = state.sectionObj.begin();
      state.sectionInit = true;
      state.sectionHeaderPrinted = false;
    }

    if (!state.sectionHeaderPrinted)
    {
      state.line = "\n[";
      state.line += sectionName;
      state.line += "]\n";
      state.sectionHeaderPrinted = true;
      return true;
    }

    if (state.sectionIt == state.sectionObj.end())
    {
      state.sectionIndex++;
      state.sectionInit = false;
      continue;
    }

    JsonPair kv = *state.sectionIt;
    ++state.sectionIt;

    state.line = sectionName;
    state.line += ".";
    state.line += kv.key().c_str();
    state.line += "=";
    if (kv.value().is<const char *>())
    {
      state.line += kv.value().as<const char *>();
    }
    else
    {
      char valBuf[64];
      size_t n = serializeJson(kv.value(), valBuf, sizeof(valBuf) - 1);
      valBuf[n] = '\0';
      state.line += valBuf;
    }
    state.line += "\n";
    return true;
  }

  return false;
}



void handleWebSocketMessage(void *arg, uint8_t *data, size_t len)
{
  AwsFrameInfo *info = (AwsFrameInfo *)arg;
  if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT)
  {
    // No null-termination: buffer size is not guaranteed to have extra space.
  }
}

void onEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len)
{
  switch (type)
  {
  case WS_EVT_CONNECT:
    if (ESP.getFreeHeap() < WS_MIN_HEAP)
    {
      client->close();
      break;
    }
    wsClient = client;
    notifyClients();
    Serial.printf("WS connect id=%u heap=%u\n", client->id(), ESP.getFreeHeap());
    break;
    case WS_EVT_PING:
    break;
  case WS_EVT_DISCONNECT:
    wsClient = nullptr;
    ws.cleanupClients(); // clean unused client connections
    Serial.printf("WS disconnect id=%u heap=%u\n", client->id(), ESP.getFreeHeap());
    break;
  case WS_EVT_DATA:
    handleWebSocketMessage(arg, data, len);
    break;
  case WS_EVT_PONG:
    break;
  case WS_EVT_ERROR:
    wsClient = nullptr;
    ws.cleanupClients(); // clean unused client connections
    Serial.printf("WS error id=%u heap=%u\n", client->id(), ESP.getFreeHeap());
    break;
  }
}

