softwarecrash/Solar2MQTT-ESP8266/src/main.cpp
/* Message callback of WebSerial */
void recvMsg(uint8_t *data, size_t len)
{
  String d = "";
  d.reserve(len);
  for (uint i = 0; i < len; i++)
  {
    d += char(data[i]);
  }
  commandFromUser = (d);
  webSerial.print(F("Sending ["));
  webSerial.print(d);
  webSerial.println(F("] to Device"));
}

bool resetCounter(bool count)
{

  if (count)
  {
    if (ESP.getResetInfoPtr()->reason == 6)
    {
      ESP.rtcUserMemoryRead(16, &bootcount, sizeof(bootcount));

      if (bootcount >= 10 && bootcount < 20)
      {
        settings.reset();
        ESP.eraseConfig();
        ESP.reset();
      }
      else
      {
        bootcount++;
        ESP.rtcUserMemoryWrite(16, &bootcount, sizeof(bootcount));
      }
    }
    else
    {
      bootcount = 0;
      ESP.rtcUserMemoryWrite(16, &bootcount, sizeof(bootcount));
    }
  }
  else
  {
    bootcount = 0;
    ESP.rtcUserMemoryWrite(16, &bootcount, sizeof(bootcount));
  }
  writeLog("Bootcount:%d Reboot reason:%d", bootcount, ESP.getResetInfoPtr()->reason);
  return true;
}

#include <ESPAsyncWebServer.h>


struct HtmlChunkState
{
  const char *chunks[3];
  size_t chunkLengths[3];
  uint8_t chunkIndex = 0;
  size_t chunkOffset = 0;
};

static void appendJsonString(Print &out, const char *value)
{
  out.print('"');
  if (value != nullptr)
  {
    for (const char *p = value; *p != '\0'; ++p)
    {
      char c = *p;
      switch (c)
      {
      case '\\':
      case '"':
        out.print('\\');
        out.print(c);
        break;
      case '\n':
        out.print(F("\\n"));
        break;
      case '\r':
        out.print(F("\\r"));
        break;
      case '\t':
        out.print(F("\\t"));
        break;
      default:
        out.print(c);
        break;
      }
    }
  }
  out.print('"');
}

void sendChunkedHtmlPage(AsyncWebServerRequest *request, const char *htmlBodyPROGMEM)
{
  HtmlChunkState *state = new HtmlChunkState;
  if (!state)
  {
    request->send(503, "text/plain", "Out of memory");
    return;
  }
  state->chunks[0] = HTML_HEAD;
  state->chunks[1] = htmlBodyPROGMEM;
  state->chunks[2] = HTML_FOOT;
  state->chunkLengths[0] = strlen_P(HTML_HEAD);
  state->chunkLengths[1] = strlen_P(htmlBodyPROGMEM);
  state->chunkLengths[2] = strlen_P(HTML_FOOT);

  request->onDisconnect([state]()
                        { delete state; });

  AsyncWebServerResponse *response = request->beginChunkedResponse(
      "text/html",
      [state](uint8_t *buffer, size_t maxLen, size_t) -> size_t
      {
        while (state->chunkIndex < 3)
        {
          const char *chunk = state->chunks[state->chunkIndex];
          size_t totalLen = state->chunkLengths[state->chunkIndex];

          if (state->chunkOffset >= totalLen)
          {
            state->chunkIndex++;
            state->chunkOffset = 0;
            continue;
          }

          size_t copyLen = totalLen - state->chunkOffset;
          if (copyLen > maxLen)
            copyLen = maxLen;

          for (size_t i = 0; i < copyLen; ++i)
          {
            buffer[i] = static_cast<uint8_t>(pgm_read_byte(chunk + state->chunkOffset + i));
          }
          state->chunkOffset += copyLen;
          return copyLen;
        }

        return 0;
      });

  response->setContentLength(0);
  request->send(response);
}

void sendMetaJson(AsyncWebServerRequest *request)
{
  AsyncResponseStream *response = request->beginResponseStream("application/json");
  response->print('{');
  response->print(F("\"device_name\":"));
  appendJsonString(*response, settings.data.deviceName);
  response->print(F(",\"software_version\":"));
  appendJsonString(*response, SOFTWARE_VERSION);
  response->print(F(",\"sw_version\":"));
  appendJsonString(*response, SWVERSION);
  response->print(F(",\"dark_mode\":"));
  response->print(settings.data.webUIdarkmode ? F("true") : F("false"));
  response->print(F(",\"flash_size\":"));
  response->print(ESP.getFreeSketchSpace());
  response->print('}');
  request->send(response);
}

void sendConfigJson(AsyncWebServerRequest *request)
{
  AsyncResponseStream *response = request->beginResponseStream("application/json");
  response->print('{');
  response->print(F("\"device_name\":"));
  appendJsonString(*response, settings.data.deviceName);
  response->print(F(",\"mqtt_server\":"));
  appendJsonString(*response, settings.data.mqttServer);
  response->print(F(",\"mqtt_port\":"));
  response->print(settings.data.mqttPort);
  response->print(F(",\"mqtt_user\":"));
  appendJsonString(*response, settings.data.mqttUser);
  response->print(F(",\"mqtt_password\":"));
  appendJsonString(*response, settings.data.mqttPassword);
  response->print(F(",\"mqtt_topic\":"));
  appendJsonString(*response, settings.data.mqttTopic);
  response->print(F(",\"mqtt_refresh\":"));
  response->print(settings.data.mqttRefresh);
  response->print(F(",\"mqtt_trigger\":"));
  appendJsonString(*response, settings.data.mqttTriggerPath);
  response->print(F(",\"mqtt_json\":"));
  response->print(settings.data.mqttJson ? F("true") : F("false"));
  response->print(F(",\"ha_discovery\":"));
  response->print(settings.data.haDiscovery ? F("true") : F("false"));
  response->print(F(",\"webui_dark_mode\":"));
  response->print(settings.data.webUIdarkmode ? F("true") : F("false"));
  response->print(F(",\"http_user\":"));
  appendJsonString(*response, settings.data.httpUser);
  response->print(F(",\"http_pass\":"));
  appendJsonString(*response, settings.data.httpPass);
  response->print('}');
  request->send(response);
}





void setup()
{
  analogWrite(LED_PIN, 0);
#ifdef isUART_HARDWARE
  analogWrite(LED_COM, 0);
  analogWrite(LED_SRV, 0);
  analogWrite(LED_NET, 0);
#endif
  resetCounter(true);
  DBG_BEGIN(DBG_BAUD); // Debugging towards UART1
  settings.load();
  commandFromUser.reserve(32);
  customResponse.reserve(64);
  loopbackMessage.reserve(32);
  WiFi.persistent(true); // fix wifi save bug
  WiFi.hostname(settings.data.deviceName);
  WiFi.setAutoReconnect(true);
  WiFi.setAutoConnect(true);
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  AsyncWiFiManager wm(&server, &dns);
  snprintf(mqttClientId, sizeof(mqttClientId), "%s-%06X", settings.data.deviceName, ESP.getChipId());



  wm.setMinimumSignalQuality(20); // filter weak wifi signals
  wm.setSaveConfigCallback(saveConfigCallback);

