softwarecrash/Solar2MQTT-ESP8266/src/main.cpp
  // create custom wifimanager fields

  AsyncWiFiManagerParameter custom_mqtt_server("mqtt_server", "MQTT server", NULL, MQTT_SERVER_LEN - 1);
  AsyncWiFiManagerParameter custom_mqtt_user("mqtt_user", "MQTT User", NULL, MQTT_USER_LEN - 1);
  AsyncWiFiManagerParameter custom_mqtt_pass("mqtt_pass", "MQTT Password", NULL, MQTT_PASS_LEN - 1);
  AsyncWiFiManagerParameter custom_mqtt_topic("mqtt_topic", "MQTT Topic", "Solar01", MQTT_TOPIC_LEN - 1);
  AsyncWiFiManagerParameter custom_mqtt_port("mqtt_port", "MQTT Port", "1883", 6);
  AsyncWiFiManagerParameter custom_mqtt_refresh("mqtt_refresh", "MQTT Send Interval", "300", 4);
  AsyncWiFiManagerParameter custom_device_name("device_name", "Device Name", "Solar2MQTT", DEVICE_NAME_LEN - 1);

  wm.addParameter(&custom_mqtt_server);
  wm.addParameter(&custom_mqtt_user);
  wm.addParameter(&custom_mqtt_pass);
  wm.addParameter(&custom_mqtt_topic);
  wm.addParameter(&custom_mqtt_port);
  wm.addParameter(&custom_mqtt_refresh);
  wm.addParameter(&custom_device_name);

  wm.setDebugOutput(false);       // disable wifimanager debug output
  wm.setMinimumSignalQuality(20); // filter weak wifi signals
  wm.setSaveConfigCallback(saveConfigCallback);
  // save settings if wifi setup is fire up
  bool apRunning = wm.autoConnect("Solar2MQTT-AP");
  if (shouldSaveConfig)
  {
    strncpy(settings.data.mqttServer, custom_mqtt_server.getValue(), sizeof(settings.data.mqttServer) - 1);
    settings.data.mqttServer[sizeof(settings.data.mqttServer) - 1] = '\0';
    strncpy(settings.data.mqttUser, custom_mqtt_user.getValue(), sizeof(settings.data.mqttUser) - 1);
    settings.data.mqttUser[sizeof(settings.data.mqttUser) - 1] = '\0';
    strncpy(settings.data.mqttPassword, custom_mqtt_pass.getValue(), sizeof(settings.data.mqttPassword) - 1);
    settings.data.mqttPassword[sizeof(settings.data.mqttPassword) - 1] = '\0';
    settings.data.mqttPort = atoi(custom_mqtt_port.getValue());
    strncpy(settings.data.deviceName, custom_device_name.getValue(), sizeof(settings.data.deviceName) - 1);
    settings.data.deviceName[sizeof(settings.data.deviceName) - 1] = '\0';
    strncpy(settings.data.mqttTopic, custom_mqtt_topic.getValue(), sizeof(settings.data.mqttTopic) - 1);
    settings.data.mqttTopic[sizeof(settings.data.mqttTopic) - 1] = '\0';
    settings.data.mqttRefresh = atoi(custom_mqtt_refresh.getValue());
    settings.save();
    ESP.restart();
  }

  mqttclient.setServer(settings.data.mqttServer, settings.data.mqttPort);

  mqttclient.setCallback(mqttcallback);

  // check is WiFi connected
  if (apRunning)
  {
    server.on("/old", HTTP_GET, [](AsyncWebServerRequest *request)
              {
              if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
              sendChunkedHtmlPage(request, HTML_MAIN); });



              server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                sendChunkedHtmlPage(request, HTML_MAIN);});
      

    server.on("/livejson", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                AsyncResponseStream *response = request->beginResponseStream("application/json");
                serializeJson(Json, *response);
                request->send(response); });

    server.on("/favicon.ico", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                AsyncWebServerResponse *response = request->beginResponse_P(200, "image/x-icon", favicon_ico, sizeof(favicon_ico));
                response->addHeader("Cache-Control", "public, max-age=604800");
                request->send(response); });

    server.on("/meta", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                sendMetaJson(request); });

    server.on("/config", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                sendConfigJson(request); });

    server.on("/reboot", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                sendChunkedHtmlPage(request, HTML_REBOOT);
                restartNow = true;
                RestartTimer = millis(); });

    server.on("/confirmreset", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                sendChunkedHtmlPage(request, HTML_CONFIRM_RESET); });
    server.on("/reset", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                AsyncWebServerResponse *response = request->beginResponse(200, "text/plain", "Device is Erasing...");
                response->addHeader("Refresh", "15; url=/");
                response->addHeader("Connection", "close");
                request->send(response);
                delay(1000);
                settings.reset();
                ESP.eraseConfig();
                ESP.restart(); });

    server.on("/settingsedit", HTTP_GET, [](AsyncWebServerRequest *request) {
      if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
      sendChunkedHtmlPage(request, HTML_SETTINGS_EDIT);});

    server.on("/settings", HTTP_GET, [](AsyncWebServerRequest *request) {
      if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
      sendChunkedHtmlPage(request, HTML_SETTINGS);});

    server.on("/settingssave", HTTP_POST, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                strncpy(settings.data.mqttServer, request->arg("post_mqttServer").c_str(), sizeof(settings.data.mqttServer) - 1);
                settings.data.mqttServer[sizeof(settings.data.mqttServer) - 1] = '\0';
                settings.data.mqttPort = request->arg("post_mqttPort").toInt();
                strncpy(settings.data.mqttUser, request->arg("post_mqttUser").c_str(), sizeof(settings.data.mqttUser) - 1);
                settings.data.mqttUser[sizeof(settings.data.mqttUser) - 1] = '\0';
                strncpy(settings.data.mqttPassword, request->arg("post_mqttPassword").c_str(), sizeof(settings.data.mqttPassword) - 1);
                settings.data.mqttPassword[sizeof(settings.data.mqttPassword) - 1] = '\0';
                strncpy(settings.data.mqttTopic, request->arg("post_mqttTopic").c_str(), sizeof(settings.data.mqttTopic) - 1);
                settings.data.mqttTopic[sizeof(settings.data.mqttTopic) - 1] = '\0';
                settings.data.mqttRefresh = request->arg("post_mqttRefresh").toInt() < 1 ? 1 : request->arg("post_mqttRefresh").toInt(); // prevent lower numbers
                strncpy(settings.data.deviceName, request->arg("post_deviceName").c_str(), sizeof(settings.data.deviceName) - 1);
                settings.data.deviceName[sizeof(settings.data.deviceName) - 1] = '\0';
                settings.data.mqttJson = (request->arg("post_mqttjson") == "true") ? true : false;
                strncpy(settings.data.mqttTriggerPath, request->arg("post_mqtttrigger").c_str(), sizeof(settings.data.mqttTriggerPath) - 1);
                settings.data.mqttTriggerPath[sizeof(settings.data.mqttTriggerPath) - 1] = '\0';
                settings.data.webUIdarkmode = (request->arg("post_webuicolormode") == "true") ? true : false;
                strncpy(settings.data.httpUser, request->arg("post_httpUser").c_str(), sizeof(settings.data.httpUser) - 1);
                settings.data.httpUser[sizeof(settings.data.httpUser) - 1] = '\0';
                strncpy(settings.data.httpPass, request->arg("post_httpPass").c_str(), sizeof(settings.data.httpPass) - 1);
                settings.data.httpPass[sizeof(settings.data.httpPass) - 1] = '\0';
                settings.data.haDiscovery = (request->arg("post_hadiscovery") == "true") ? true : false;
                settings.save();
                request->redirect("/reboot"); });

    server.on("/set", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                 
                if (request->hasParam("CC")) {
                    const AsyncWebParameter *p = request->getParam("CC");
                    commandFromUser = p->value();
                }
                if (request->hasParam("ha")) {
                    haDiscTrigger = true;
                }
                request->send(200, "text/plain", "message received"); });

