softwarecrash/Solar2MQTT-ESP8266/src/main.cpp
    server.on("/debug/loopback-test", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                if (loopbackInProgress || loopbackRequested) {
                  request->send(409, "application/json", "{\"started\":false,\"message\":\"Loopback already running\"}");
                  return;
                }
                loopbackRequested = true;
                loopbackDone = false;
                loopbackMessage = "Loopback started";
                request->send(202, "application/json", "{\"started\":true,\"message\":\"Loopback started\"}"); });

    server.on("/debug/loopback-status", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                AsyncResponseStream *response = request->beginResponseStream("application/json");
                response->print(F("{\"running\":"));
                response->print(loopbackInProgress ? F("true") : F("false"));
                response->print(F(",\"done\":"));
                response->print(loopbackDone ? F("true") : F("false"));
                response->print(F(",\"ok\":"));
                response->print(loopbackOk ? F("true") : F("false"));
                response->print(F(",\"message\":"));
                appendJsonString(*response, loopbackMessage.c_str());
                response->print('}');
                request->send(response); });

    server.on("/debug/download", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();

                bool prevWorkerCanRun = workerCanRun;
                workerCanRun = false;
                mppClient.setSuspend(true);

                auto cleanup = [prevWorkerCanRun]() {
                  mppClient.setSuspend(false);
                  workerCanRun = prevWorkerCanRun;
                };
                request->onDisconnect(cleanup);

                auto state = std::make_shared<DebugDownloadState>();
                state->line.reserve(256);

                AsyncWebServerResponse *response = request->beginChunkedResponse(
                  "text/plain",
                  [state](uint8_t *buffer, size_t maxLen, size_t) -> size_t {
                    size_t written = 0;
                    while (written < maxLen)
                    {
                      if (state->lineOffset >= state->line.length())
                      {
                        if (!buildNextDebugLine(*state))
                        {
                          break;
                        }
                      }

                      size_t available = state->line.length() - state->lineOffset;
                      size_t toCopy = maxLen - written;
                      if (toCopy > available)
                      {
                        toCopy = available;
                      }

                      memcpy(buffer + written, state->line.c_str() + state->lineOffset, toCopy);
                      state->lineOffset += toCopy;
                      written += toCopy;
                    }

                    return written;
                  });

                response->addHeader("Content-Disposition", "attachment; filename=\"solar2mqtt-debug.txt\"");
                response->addHeader("Cache-Control", "no-store");
                response->addHeader("Pragma", "no-cache");
                response->addHeader("Connection", "close");
                request->send(response); });

    auto &debugHandler = server.on("/debug", HTTP_GET, [](AsyncWebServerRequest *request) {
                  if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
                  sendChunkedHtmlPage(request, HTML_DEBUG);});
    debugHandler.setFilter([](AsyncWebServerRequest *request) {
                  return request->url() == "/debug";
                });

    server.on(
        "/update", HTTP_POST, [](AsyncWebServerRequest *request)
        {
          if(strlen(settings.data.httpUser) > 0 && !request->authenticate(settings.data.httpUser, settings.data.httpPass)) return request->requestAuthentication();
       //To upload through terminal you can use: curl -F "image=@firmware.bin" <ESP_IP>/update

    //https://gist.github.com/JMishou/60cb762047b735685e8a09cd2eb42a60
    // the request handler is triggered after the upload has finished... 
    // create the response, add header, and send response
    AsyncWebServerResponse *response = request->beginResponse(200, "text/plain", (Update.hasError())?"FAIL":"OK");
    response->addHeader("Connection", "close");
    response->addHeader("Access-Control-Allow-Origin", "*");
    //restartNow = true; // Tell the main loop to restart the ESP
    //RestartTimer = millis();  // Tell the main loop to restart the ESP
    request->send(response); },
        [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
        {
          // Upload handler chunks in data

          if (!index)
          { // if index == 0 then this is the first frame of data
            Serial.printf("UploadStart: %s\n", filename.c_str());
            Serial.setDebugOutput(true);

            // calculate sketch space required for the update
            uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
            if (!Update.begin(maxSketchSpace))
            { // start with max available size
              Update.printError(Serial);
            }
            Update.runAsync(true); // tell the updaterClass to run in async mode
          }

