softwarecrash/Solar2MQTT-ESP8266/src/main.cpp
          // Write chunked data to the free sketch space
          if (Update.write(data, len) != len)
          {
            Update.printError(Serial);
          }

          if (final)
          { // if the final flag is set then this is the last frame of data
            if (Update.end(true))
            { // true to set the size to the current progress
              Serial.printf("Update Success: %u B\nRebooting...\n", index + len);
            }
            else
            {
              Update.printError(Serial);
            }
            Serial.setDebugOutput(false);
          }
        });

    server.onNotFound([](AsyncWebServerRequest *request)
                      { request->send(418, "text/plain", "418 I'm a teapot"); });

    // set the device name

    MDNS.begin(settings.data.deviceName);
    MDNS.addService("http", "tcp", 80);
    ws.onEvent(onEvent);
    ws.handleHandshake([](AsyncWebServerRequest *request) -> bool
                       {
                         uint32_t heap = ESP.getFreeHeap();
                         if (heap < WS_MIN_HEAP)
                         {
                           Serial.printf("WS handshake rejected (heap=%u)\n", heap);
                           return false;
                         }
                         if (ws.count() >= 1)
                         {
                           Serial.printf("WS handshake rejected (client limit, heap=%u)\n", heap);
                           return false;
                         }
                         Serial.printf("WS handshake accepted (heap=%u)\n", heap);
                         return true;
                       });
    server.addHandler(&ws);
    webSerial.begin(&server);
    webSerial.onMessage(recvMsg);

    server.begin();

    mppClient.callback(prozessData);
    mppClient.Init(); // init the PI_serial Library
    mqtttimer = (settings.data.mqttRefresh * 1000) * (-1);
  }

  analogWrite(LED_PIN, 255);
#ifdef isUART_HARDWARE
  analogWrite(LED_COM, 255);
  analogWrite(LED_SRV, 255);
  analogWrite(LED_NET, 255);
#endif
  resetCounter(false);

#ifdef TEMPSENS_PIN
  tempSens.begin(NonBlockingDallas::resolution_12, TIME_INTERVAL);
  tempSens.onTemperatureChange(handleTemperatureChange);
#endif
}

void loop()
{
  MDNS.update();
  handleLoopback();
  if (millis() - wsCleanupTimer > 5000)
  {
    ws.cleanupClients();
    wsCleanupTimer = millis();
  }
  if (Update.isRunning())
  {
    workerCanRun = false; // lockout, atfer true need reboot
  }
  if (workerCanRun)
  {
    // Make sure wifi is in the right mode
    if (WiFi.status() == WL_CONNECTED)
    { 
      // No use going to next step unless WIFI is up and running.
      if (commandFromUser != "")
      {
        if (commandFromUser == "autodetect")
        {
          writeLog("restart autodetect");
          mppClient.Init();
        }
        else if (commandFromUser.startsWith("setp "))
        {
          // Extract the parameter substring after "setp "
          String parameterString = commandFromUser.substring(5);
          int parameter = parameterString.toInt();
          if (parameterString != "0" && parameter == 0)
          {
            writeLog("Invalid parameter for 'setp' command.");
          }
          else if (parameter >= NoD && parameter < PROTOCOL_TYPE_MAX)
          {
            mppClient.protocol = static_cast<protocol_type_t>(parameter);
            writeLog("Change protocol to: %s", protocolStrings[parameter]);
          }
          else
          {
            writeLog("Unknown protocol");
          }
        }
        else
        {
          String tmp = mppClient.sendCommand(commandFromUser); // send a custom command to the device
        }
        commandFromUser = "";
        mqtttimer = 0;
      }
#ifdef TEMPSENS_PIN
      tempSens.update();
#endif

      mppClient.loop();    // Call the PI Serial Library loop
      mqttclient.loop();
      if (haDiscTrigger || settings.data.haDiscovery)
      {
        if (ESP.getFreeHeap() >= HA_MIN_HEAP &&
            (millis() - haDiscLastAttempt) >= HA_MIN_INTERVAL_MS &&
            measureJson(Json) > jsonSize)
        {
          haDiscLastAttempt = millis();
          if (sendHaDiscovery())
          {
            haDiscTrigger = false;
            jsonSize = measureJson(Json);
          }
        }
      }
    }
  }
  if (restartNow && millis() >= (RestartTimer + 500))
  {
    ESP.restart();
  }
  notificationLED(); // notification LED routine
}

bool prozessData()
{
  if (millis() < (slowDownTimer + 1000) && mppClient.protocol == 0)
  {
    return true;
  }
  writeLog("ProzessData P:%s C:%s", (String)mppClient.protocol, (String)mppClient.connection);
  getJsonData();
  if (ws.count() > 0)
  {
    notifyClients();
  }
  if (millis() - mqtttimer > (settings.data.mqttRefresh * 1000) || mqtttimer == 0)
  {
#ifdef TEMPSENS_PIN
    tempSens.requestTemperature();
#endif

    sendtoMQTT(); // Update data to MQTT server if we should
    mqtttimer = millis();
  }

  slowDownTimer = millis();
  return true;
}

void getJsonData()
{
  deviceJson[F("Device_name")] = settings.data.deviceName;
  deviceJson[F("ESP_VCC")] = ESP.getVcc() / 1000.0;
  deviceJson[F("Wifi_RSSI")] = WiFi.RSSI();
  deviceJson[F("sw_version")] = SOFTWARE_VERSION;
  deviceJson[F("Free_Heap")] = ESP.getFreeHeap();
  deviceJson[F("HEAP_Fragmentation")] = ESP.getHeapFragmentation();
  deviceJson[F("runtime")] = millis() / 1000;
  deviceJson[F("ws_clients")] = ws.count();
  deviceJson[F("detect_protocol")] = mppClient.protocol;
  deviceJson[F("detect_raw_qpi")] = mppClient.get.raw.qpi;
#ifdef TEMPSENS_PIN
  if (tempSens.indexExist(tempSens.getSensorsCount() - 1))
  {
    for (size_t i = 0; i < tempSens.getSensorsCount(); i++)
    {
      char key[16];
      snprintf(key, sizeof(key), "DS18B20_%u", static_cast<unsigned int>(i + 1));
      deviceJson[key] = tempSens.getTemperatureC(i);
    }
  }
#endif
}

char *topicBuilder(char *buffer, char const *path, char const *numering = "")
{                                                  // buffer, topic
  const char *mainTopic = settings.data.mqttTopic; // get the main topic path
  snprintf(buffer, MQTT_TOPIC_BUFFER_LEN, "%s/%s%s", mainTopic, path, numering);
  return buffer;
}

static void publishJsonValue(PubSubClient &client, const char *topic, JsonVariantConst value)
{
  const char *str = value.as<const char *>();
  if (str != nullptr)
  {
    client.publish(topic, str);
    return;
  }
  if (value.isNull())
  {
    client.publish(topic, "");
    return;
  }
  char buffer[64];
  size_t n = serializeJson(value, buffer, sizeof(buffer) - 1);
  buffer[n] = '\0';
  client.publish(topic, buffer);
}

bool connectMQTT()
{
  if (strcmp(settings.data.mqttServer, "") == 0)
    return false;
  char buff[MQTT_TOPIC_BUFFER_LEN];
  if (!mqttclient.connected())
  {
    firstPublish = false;

    if (mqttclient.connect(mqttClientId, settings.data.mqttUser, settings.data.mqttPassword, (topicBuilder(buff, "Alive")), 0, true, "false", true))
    {
      if (mqttclient.connected())
      {
        mqttclient.publish(topicBuilder(buff, "Alive"), "true", true); // LWT online message must be retained!
        char ipStr[16];
        IPAddress ip = WiFi.localIP();
        snprintf(ipStr, sizeof(ipStr), "%u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
        mqttclient.publish(topicBuilder(buff, "IP"), ipStr, true);
        mqttclient.subscribe(topicBuilder(buff, "DeviceControl/Set_Command"));
        if (strlen(settings.data.mqttTriggerPath) >= 1)
        {
          mqttclient.subscribe(settings.data.mqttTriggerPath);
        }
      }
    }
    else
    {
      return false; // Exit if we couldnt connect to MQTT brooker
    }
    firstPublish = true;
    writeLog("MQTT Client State: %d", mqttclient.state());
  }
  return true;
}

bool sendtoMQTT()
{
  char buff[MQTT_TOPIC_BUFFER_LEN]; // temp buffer for the topic string
  if (!connectMQTT())
  {
    writeLog("No connection to MQTT Server: %d", mqttclient.state());
    firstPublish = false;
    return false;
  }
  if (!settings.data.mqttJson)
  {
    char msgBuffer1[MQTT_TOPIC_BUFFER_LEN];
    for (JsonPair jsonDev : Json.as<JsonObject>())
    {
      for (JsonPair jsondat : jsonDev.value().as<JsonObject>())
      {
        snprintf(msgBuffer1, sizeof(msgBuffer1), "%s/%s/%s", settings.data.mqttTopic, jsonDev.key().c_str(), jsondat.key().c_str());
        publishJsonValue(mqttclient, msgBuffer1, jsondat.value());
      }
    }
    if (mppClient.get.raw.commandAnswer.length() > 0)
    {
      char cmdTopic[MQTT_TOPIC_BUFFER_LEN];
      snprintf(cmdTopic, sizeof(cmdTopic), "%s/DeviceControl/Set_Command_answer", settings.data.mqttTopic);
      mqttclient.publish(cmdTopic, (mppClient.get.raw.commandAnswer).c_str());
      writeLog("raw command answer: %s", mppClient.get.raw.commandAnswer.c_str());
      mppClient.get.raw.commandAnswer = "";
    }
    // RAW
    mqttclient.publish(topicBuilder(buff, "RAW/Q1"), (mppClient.get.raw.q1).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QPIGS"), (mppClient.get.raw.qpigs).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QPIGS2"), (mppClient.get.raw.qpigs2).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QPIRI"), (mppClient.get.raw.qpiri).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QT"), (mppClient.get.raw.qt).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QET"), (mppClient.get.raw.qet).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QEY"), (mppClient.get.raw.qey).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QEM"), (mppClient.get.raw.qem).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QED"), (mppClient.get.raw.qed).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QLT"), (mppClient.get.raw.qlt).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QLY"), (mppClient.get.raw.qly).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QLM"), (mppClient.get.raw.qlm).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QLD"), (mppClient.get.raw.qld).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QPI"), (mppClient.get.raw.qpi).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QMOD"), (mppClient.get.raw.qmod).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QALL"), (mppClient.get.raw.qall).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QMN"), (mppClient.get.raw.qmn).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QPIWS"), (mppClient.get.raw.qpiws).c_str());
    mqttclient.publish(topicBuilder(buff, "RAW/QFLAG"), (mppClient.get.raw.qflag).c_str());
  }
  else
  {
    mqttclient.beginPublish(topicBuilder(buff, "Data"), measureJson(Json), false);
    serializeJson(Json, mqttclient);
    mqttclient.endPublish();
    if (settings.data.haDiscovery || haDiscTrigger)
    {
      char msgBuffer1[MQTT_TOPIC_BUFFER_LEN];
      for (JsonPair jsonDev : Json.as<JsonObject>())
      {
        for (JsonPair jsondat : jsonDev.value().as<JsonObject>())
        {
          snprintf(msgBuffer1, sizeof(msgBuffer1), "%s/%s/%s", settings.data.mqttTopic, jsonDev.key().c_str(), jsondat.key().c_str());
          publishJsonValue(mqttclient, msgBuffer1, jsondat.value());
        }
      }
    }
  }
  mqttclient.publish(topicBuilder(buff, "Alive"), "true", true); // LWT online message must be retained!
  {
    char rssiBuf[12];
    snprintf(rssiBuf, sizeof(rssiBuf), "%d", WiFi.RSSI());
    mqttclient.publish(topicBuilder(buff, "EspData/Wifi_RSSI"), rssiBuf);
  }
  writeLog("Data sent to MQTT");
  firstPublish = true;

