softwarecrash/Solar2MQTT-ESP8266/src/main.cpp
  return true;
}

void mqttcallback(char *top, unsigned char *payload, unsigned int length)
{
  char buff[MQTT_TOPIC_BUFFER_LEN];
  String messageTemp;
  messageTemp.reserve(length);
  for (unsigned int i = 0; i < length; i++)
  {
    messageTemp += (char)payload[i];
  }
  if (strlen(settings.data.mqttTriggerPath) > 0 && strcmp(top, settings.data.mqttTriggerPath) == 0)
  {
    writeLog("MQTT Data Trigger Firered Up");
    mqtttimer = (settings.data.mqttRefresh * 1000) * (-1);
  }

  if (messageTemp == "NAK" || messageTemp == "(NAK" || messageTemp == "")
    return;

  // send raw control command
  if (strcmp(top, topicBuilder(buff, "DeviceControl/Set_Command")) == 0 && messageTemp.length() > 0)
  {
    writeLog("Command received: %s", messageTemp.c_str());
    commandFromUser = messageTemp;
  }
}

static size_t appendFmt(char *buffer, size_t bufferSize, size_t pos, const char *fmt, ...)
{
  if (pos >= bufferSize)
  {
    return pos;
  }
  va_list args;
  va_start(args, fmt);
  int written = vsnprintf(buffer + pos, bufferSize - pos, fmt, args);
  va_end(args);
  if (written < 0)
  {
    return pos;
  }
  size_t w = static_cast<size_t>(written);
  if (w >= bufferSize - pos)
  {
    return bufferSize - 1;
  }
  return pos + w;
}

static const char *readDescriptorString(const char *const (*table)[4], size_t row, size_t col)
{
  return reinterpret_cast<const char *>(pgm_read_ptr(&table[row][col]));
}

bool sendHaDiscovery()
{
  if (ESP.getFreeHeap() < HA_MIN_HEAP)
  {
    writeLog("HA discovery skipped (low heap)");
    return false;
  }
  if (!connectMQTT())
  {
    return false;
  }
  const char *deviceModel = staticData["Device_Model"] | "";
  char ipStr[16];
  IPAddress ip = WiFi.localIP();
  snprintf(ipStr, sizeof(ipStr), "%u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
  char deviceDesc[256];
  size_t devicePos = 0;
  devicePos = appendFmt(deviceDesc, sizeof(deviceDesc), devicePos, "\"dev\":{");
  devicePos = appendFmt(deviceDesc, sizeof(deviceDesc), devicePos, "\"ids\":[\"%s\"],", mqttClientId);
  devicePos = appendFmt(deviceDesc, sizeof(deviceDesc), devicePos, "\"name\":\"%s\",", settings.data.deviceName);
  devicePos = appendFmt(deviceDesc, sizeof(deviceDesc), devicePos, "\"cu\":\"http://%s\",", ipStr);
  devicePos = appendFmt(deviceDesc, sizeof(deviceDesc), devicePos, "\"mdl\":\"%s\",", deviceModel);
  devicePos = appendFmt(deviceDesc, sizeof(deviceDesc), devicePos, "\"mf\":\"SoftWareCrash\",");
  devicePos = appendFmt(deviceDesc, sizeof(deviceDesc), devicePos, "\"sw\":\"%s\"}", SOFTWARE_VERSION);

  char topBuff[MQTT_TOPIC_BUFFER_LEN];
  char payload[512];
  for (size_t i = 0; i < sizeof haStaticDescriptor / sizeof haStaticDescriptor[0]; i++)
  {
    const char *name = readDescriptorString(haStaticDescriptor, i, 0);
    const char *icon = readDescriptorString(haStaticDescriptor, i, 1);
    const char *unit = readDescriptorString(haStaticDescriptor, i, 2);
    const char *devClass = readDescriptorString(haStaticDescriptor, i, 3);
    if (staticData[name].is<JsonVariant>())
    {
      size_t pos = 0;
      pos = appendFmt(payload, sizeof(payload), pos, "{");
      pos = appendFmt(payload, sizeof(payload), pos, "\"name\":\"%s\",", name);
      pos = appendFmt(payload, sizeof(payload), pos, "\"stat_t\":\"%s/DeviceData/%s\",", settings.data.mqttTopic, name);
      pos = appendFmt(payload, sizeof(payload), pos, "\"avty_t\":\"%s/Alive\",", settings.data.mqttTopic);
      pos = appendFmt(payload, sizeof(payload), pos, "\"pl_avail\":\"true\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"pl_not_avail\":\"false\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"uniq_id\":\"%s.%s\",", mqttClientId, name);
      pos = appendFmt(payload, sizeof(payload), pos, "\"ic\":\"mdi:%s\",", icon);
      if (unit != nullptr && unit[0] != '\0')
      {
        pos = appendFmt(payload, sizeof(payload), pos, "\"unit_of_meas\":\"%s\",", unit);
      }
      if (devClass != nullptr && devClass[0] != '\0')
      {
        pos = appendFmt(payload, sizeof(payload), pos, "\"dev_cla\":\"%s\",", devClass);
      }
      pos = appendFmt(payload, sizeof(payload), pos, "%s}", deviceDesc);
      snprintf(topBuff, sizeof(topBuff), "homeassistant/sensor/%s/%s/config", settings.data.mqttTopic, name); // build the topic
      mqttclient.beginPublish(topBuff, pos, true);
      mqttclient.write((const uint8_t *)payload, pos);
      mqttclient.endPublish();
    }
  }

  for (size_t i = 0; i < sizeof haLiveDescriptor / sizeof haLiveDescriptor[0]; i++)
  {
    const char *name = readDescriptorString(haLiveDescriptor, i, 0);
    const char *icon = readDescriptorString(haLiveDescriptor, i, 1);
    const char *unit = readDescriptorString(haLiveDescriptor, i, 2);
    const char *devClass = readDescriptorString(haLiveDescriptor, i, 3);
    if (liveData[name].is<JsonVariant>())
    {
      size_t pos = 0;
      pos = appendFmt(payload, sizeof(payload), pos, "{");
      pos = appendFmt(payload, sizeof(payload), pos, "\"name\":\"%s\",", name);
      pos = appendFmt(payload, sizeof(payload), pos, "\"stat_t\":\"%s/LiveData/%s\",", settings.data.mqttTopic, name);
      pos = appendFmt(payload, sizeof(payload), pos, "\"avty_t\":\"%s/Alive\",", settings.data.mqttTopic);
      pos = appendFmt(payload, sizeof(payload), pos, "\"pl_avail\":\"true\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"pl_not_avail\":\"false\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"uniq_id\":\"%s.%s\",", mqttClientId, name);
      pos = appendFmt(payload, sizeof(payload), pos, "\"ic\":\"mdi:%s\",", icon);
      if (unit != nullptr && unit[0] != '\0')
      {
        pos = appendFmt(payload, sizeof(payload), pos, "\"unit_of_meas\":\"%s\",", unit);
      }
      if (devClass != nullptr && devClass[0] != '\0')
      {
        pos = appendFmt(payload, sizeof(payload), pos, "\"dev_cla\":\"%s\",", devClass);
      }
      pos = appendFmt(payload, sizeof(payload), pos, "%s}", deviceDesc);
      snprintf(topBuff, sizeof(topBuff), "homeassistant/sensor/%s/%s/config", settings.data.mqttTopic, name); // build the topic
      mqttclient.beginPublish(topBuff, pos, true);
      mqttclient.write((const uint8_t *)payload, pos);
      mqttclient.endPublish();
    }
  }
#ifdef TEMPSENS_PIN
  // Ext Temp sensors
  if (tempSens.indexExist(tempSens.getSensorsCount() - 1))
  {
    for (size_t i = 0; i < tempSens.getSensorsCount(); i++)
    {
      char tempDeviceDesc[256];
      size_t tempDescPos = 0;
      tempDescPos = appendFmt(tempDeviceDesc, sizeof(tempDeviceDesc), tempDescPos, "\"dev\":{");
      tempDescPos = appendFmt(tempDeviceDesc, sizeof(tempDeviceDesc), tempDescPos, "\"ids\":[\"%s\"],", mqttClientId);
      tempDescPos = appendFmt(tempDeviceDesc, sizeof(tempDeviceDesc), tempDescPos, "\"name\":\"%s\",", settings.data.deviceName);
      tempDescPos = appendFmt(tempDeviceDesc, sizeof(tempDeviceDesc), tempDescPos, "\"cu\":\"http://%s\",", ipStr);
      tempDescPos = appendFmt(tempDeviceDesc, sizeof(tempDeviceDesc), tempDescPos, "\"mdl\":\"EPEver2MQTT\",");
      tempDescPos = appendFmt(tempDeviceDesc, sizeof(tempDeviceDesc), tempDescPos, "\"mf\":\"SoftWareCrash\",");
      tempDescPos = appendFmt(tempDeviceDesc, sizeof(tempDeviceDesc), tempDescPos, "\"sw\":\"%s\"}", SOFTWARE_VERSION);

      size_t pos = 0;
      pos = appendFmt(payload, sizeof(payload), pos, "{");
      pos = appendFmt(payload, sizeof(payload), pos, "\"name\":\"DS18B20_%d\",", (i + 1));
      pos = appendFmt(payload, sizeof(payload), pos, "\"stat_t\":\"%s/DS18B20_%d\",", settings.data.mqttTopic, (i + 1));
      pos = appendFmt(payload, sizeof(payload), pos, "\"avty_t\":\"%s/Alive\",", settings.data.mqttTopic);
      pos = appendFmt(payload, sizeof(payload), pos, "\"pl_avail\":\"true\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"pl_not_avail\":\"false\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"uniq_id\":\"%s.DS18B20_%d\",", mqttClientId, (i + 1));
      pos = appendFmt(payload, sizeof(payload), pos, "\"ic\":\"mdi:thermometer-lines\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"unit_of_meas\":\"°C\",");
      pos = appendFmt(payload, sizeof(payload), pos, "\"dev_cla\":\"temperature\",");
      pos = appendFmt(payload, sizeof(payload), pos, "%s}", tempDeviceDesc);
      snprintf(topBuff, sizeof(topBuff), "homeassistant/sensor/%s/DS18B20_%d/config", settings.data.mqttTopic, (i + 1)); // build the topic

      mqttclient.beginPublish(topBuff, pos, true);
      mqttclient.write((const uint8_t *)payload, pos);
      mqttclient.endPublish();
    }
  }
#endif
  return true;
}

void handleTemperatureChange(int deviceIndex, int32_t temperatureRAW)
{
  #ifdef TEMPSENS_PIN
  writeLog("<DS18x> DS18B20_%d RAW:%d Celsius:%f Fahrenheit:%f", deviceIndex + 1, temperatureRAW, tempSens.rawToCelsius(temperatureRAW), tempSens.rawToFahrenheit(temperatureRAW));
  char msgBuffer[32];
  char buff[MQTT_TOPIC_BUFFER_LEN]; // temp buffer for the topic string
  mqttclient.publish(topicBuilder(buff, "DS18B20_", itoa((deviceIndex) + 1, msgBuffer, 10)), dtostrf(tempSens.rawToCelsius(temperatureRAW), 4, 2, msgBuffer));
#endif
}

void writeLog(const char *format, ...)
{
  char msg[100];
  va_list args;

  va_start(args, format);
  vsnprintf(msg, sizeof(msg), format, args); // do check return value
  va_end(args);

  // write msg to the log
  DBG_PRINTLN(msg);
  if (webSerial.getConnectionCount() > 0)
  {
    DBG_WEB(msg);
  }
}

